[
  {
    "title": "AI in the Classroom: CPD",
    "date": "28 December 2025",
    "content": "<p>I'm happy to share that I've obtained a new certification: AI in the classroom from Canva!</p> <p>Becoming a Canvassador last year has encouraged me to widen my knowledge of Canva and how I can use the platform beyond the Canva Code experiments I have been publishing. I wanted to dive deeper into how generative AI can practically transform the day-to-day lives of teachers. <p>This course gave me hands on experience using Magic Design, Magic Write and Magic Media with a specific focus on how it can help teachers / educators in the classroom to enhance lesson planning, create personalised learning materials and boost student engagement.</p> <p>I'm excited to integrate these new skills into my workflow and image some creative ways to support the education community.</p>"
},
{
    "title": "Canva's Newest Updates",
    "date": "3 November 2025",
    "content": "<p>Just when I thought I'd caught up with, and tested, the new features from the last Canva Create event, this week’s launch provides another massive leap forward.</p><p>As an avid Canva user (and full disclosure, a Canvassador), I’m constantly pushing the platform's limits, especially for building gamified classroom activities with Canva Code.</p><p>I'm trying to look at these updates as objectively as possible, and honestly, this new launch isn't just an update; it feels like a direct response to the exact features I (and others) thought were missing.</p><p>Here's my take:</p><p>✦ <b>Canva Code / Sheets Connection:</b> This is the most exciting one in my eyes. In my gamified resources, the one thing missing was a way to manage live data. The possibilities have now truly opened up. I'm incredibly excited to use the Sheets Connection to export pupil scores, track performance, and possibly integrate live leaderboards into my classroom activities. I think a part four of my Canva Code adventures is in order.</p><p>✦ <b>Forms:</b> I'm really interested to see how this stacks up against Google Forms, Notion Forms, and other similar tools. The potential to have a fully built forms that moves data directly into Canva Sheets is a huge workflow win.</p><p>✦ <b>Affinity (Now Free, with AI):</b> This is a huge signal to the industry that subscription models may be outdated. At my school, we use Adobe at the moment, but, based on the tools being offered, this could indicate the potential to move away from these premium subscription-based tools. I've used Affinity for years, and this new all-in-one suite is amazing. The main thing I felt was missing was AI, and now we've got that. More testing is definitely required, but this is a massive development.</p><p>✦ <b>Video 2.0:</b> As an amateur editor, I've always worked in tools like DaVinci Resolve and not yet touched Canva's video features. However, more and more enthusiasts have been suggesting it's a 'remarkably powerful' editor, and that was before this update. Needless to say, I've got to give Video 2.0 and its Magic Video features a go now.</p><p>✦ <b>Enhanced Brand Kits:</b> A simple but essential win. I use Brand Kits daily to make my teacher slides and worksheets, so anything that improves that experience and streamlines consistency is greatly appreciated.</p><p>✦ <b>Other Small Updates:</b> I'm also excited for the smaller quality-of-life updates, like finally getting gradient text and being able to use your phone as a remote control for presentations. These are practical tweaks I can use all the time.</p><p>Canva is seriously levelling up from just a design tool into a full-on creative workspace. I can't wait to get stuck in and see what's possible!</p>"
  },
  {
    "title": "Awarded PGCE with Distinction",
    "date": "29 October 2025",
    "content": "<p>I'm absolutely thrilled to share that I’ve officially received my PGCE certificate in Secondary Computing, which I completed through the Teach First Training Programme.</p><p>I’m incredibly proud to have been awarded a Distinction grade!</p><p>This journey has been a different and rewarding experience in my academic journey so far. Achieving a Distinction required a deep dive into pedagogical research and reflecting on my own practice. I’m particularly proud of the work I submitted for my two assignments:</p><p>✦ <b>M1 Essay:</b> An exploration of what makes an effective teacher of computing. I focused my research on the impact of modelling and pair programming on Year 8 pupils as they tackled Python for the first time, transitioning away from block-based programming.</p><p>✦ <b>M2 Viva:</b> A presentation on my journey as an effective teacher, where I analysed the impact of the 'I do, We do, You do' framework and the role of gamification in boosting student engagement and understanding.</p><p>I truly could not have done this without the incredible community of mentors and peers who supported me.</p><p>A huge thank you to my amazing in-school mentor for her constant feedback and invaluable guidance, especially during my development review presentations.</p><p>I am also immensely grateful to my Teach First Computing support roles, whose guidance and advice throughout the year and on our training days, were absolutely crucial in helping me refine my M1 essay.</p><p>A final thank you to my fellow Computing trainees and my wonderful colleagues, who have all helped in different ways.</p><p>I'm so excited to take this learning and passion into my Early Career Teacher (ECT) years, and continue these pedagogical deep dives through the Teach First Ambassador Project!</p>"
  },
  {
    "title": "Facilitated AI Workshops",
    "date": "24 October 2025",
    "content": "<p>I am thrilled to have facilitated two workshops during our Trust INSET day, focusing on the ever important and critical topic of using Artificial Intelligence as educators and our developing Trust-wide stance on AI. I was honoured to be invited to lead these sessions by our Director of Education (School Improvement Lead). These sessions were able to combine my expertise with AI, my practical experience with using AI models as a teacher, as well as an incredible slide deck to create an engaging, exciting and informative presentation.</p><p>The sessions went fantastically and saw lots of engagement from the attending staff. Plenty had questions about the use of AI within schools, and I am glad that I got the chance to answer their questions. There was a diverse range of attending staff, including teaching staff and non teaching staff. Everyone, regardless of role, was able to learn something and get something out of the session. The depth of questions showed that AI has been on their minds and this is the perfect time to to training and CPD towards using it safely and effectively.</p><p>A key takeaway was the strong demand for follow-up sessions, as we simply ran out of time to explore every use case and answer every question. Asking for another session is always a positive sign of a good workshop!</p><p>As I go back to my notes, and reflect on the feedback and questions from the staff body, I am intrigued as to what I’m going to be doing next in trying to inform staff about the wonders and threats of using AI as a teacher. Their input is crucial as we plan our next steps to support all staff in integrating AI into our work, ensuring we can harness its potential responsibly and effectively.</p>"
  },
  {
    "title": "BBC News & AI in Education",
    "date": "22 October 2025",
    "content": "<p>One year ago, I had the privilege of appearing on BBC News as part of a feature on AI in Higher Education.</p><p>I was honoured to be asked and interviewed for this piece and the final product was a fantastic watch, both insightful and creative.</p><p>One of the highlights for me was the filming setup itself. We decided to shoot my interview in front of a green screen and replace the background with an AI-generated image of an office. This was created using Automatic1111’s Stable Diffusion Web UI, an open-source interface for generating images with stable diffusion models.</p><p>The result was fascinating. The background was imperfect, and that was precisely the point. Its small imperfections illustrated the concept of AI hallucinations and the inherent flaws that exist across all forms of AI-generated media.</p><p>As an amateur filmmaker and video editor myself, the filming and editing of this section was my favourite part, seeing how seamless the final product ended up being.</p><SameAs>This was my second time appearing on BBC news discussing artificial intelligence and I hope it won’t be my last.</p>"
  },
  {
    "title": "I'm officially a Canvassador!",
    "date": "8 September 2025",
    "content": "<p>✨ I’m officially a Canvassador! ✨</p><p>I’m thrilled to join the Canvassador community, and grateful for the opportunity to co-create, explore, and share Canva’s potential in education and visual innovation.</p><p>For those unfamiliar, this group of Canvassadors are volunteer educators who collaborate with the Canva for Education team to share ideas, inspire creativity, and help shape how Canva is used in classrooms around the world.</p><p>Over the past year, my blog has been a space to explore the features Canva has to offer.</p><p>The main part of this has been to experiment with AI-powered, playable classroom games using Canva Code, turning lessons into immersive experiences.</p><p>I’ve always believed in the power of creativity and technology to unlock new pathways for engagement. Becoming a Canvassador feels like a perfect next chapter. Combining design, pedagogy, and digital storytelling into one vibrant journey.</p><p>A huge thank you to the person who reached out about this opportunity. I’m really excited to get started and to give back to the community that’s already given me so much inspiration.</p><p>I hope this will be an opportunity to continuing sharing the ideas I’ve had about using Canva and to learn from others.</p>"
  },
  {
    "title": "Awarded Qualified Teacher Status (QTS)",
    "date": "5 August 2025",
    "content": "<p>I'm proud to share that I’ve officially been awarded Qualified Teacher Status (QTS) through the Teach First Training Programme.</p><p>This past year has been both challenging and rewarding. From day one in the classroom to today, I've grown enormously as a teacher and I’m incredibly grateful for the support, mentorship, and community that I've had around me this year.</p><p>A few people that I would like to thank are my mentors and colleagues who have all provided immense support to me throughout this year.</p><p>I'd also like to thank my school for welcoming me into their amazing team.</p><p>A final thanks goes to my fellow Teach First trainees, both at my school and in the wider Computing Cohort, who made training days so much fun.</p><p>Super excited to start next year as an ECT!</p>"
  },
  {
    "title": "Teach First 'AI in Education' Summit",
    "date": "15 July 2025",
    "content": "<p>This week, I attended the Teach First ‘AI in Education’ summit.</p><p>I had the privilege of joining Teach First, other educators, industry experts, and policy leaders to explore how we can use AI within education.</p><p>The highlights for me included:</p><p>✦ Gaining insights into how Teachmate is being used in practice and its potential to support teachers, in some wonderful talks and demos.</p><p>✦ An introduction to the ‘AI Safety’ resources as part of the Raspberry Pi Foundations ‘Experience AI’ curriculum.</p><p>✦ Hearing Professor Rose Luckin give her thoughts on the evolving AI landscape post release-of-ChatGPT and what it means for schools.</p><p>What really struck me was hearing about how the government / DfE are trying to build (or support the building of) tools to help teachers with their workload and within the classroom, during the talks and panels by policy leaders.</p><p>However, as with an event like this, the best part was getting to meet more people and widen my network.</p><p>Huge thanks to Teach First and all the contributors for creating this event to have these exciting conversations.</p>"
  }
]